hotelReservation/results/client_load_sweeps/20260331T203937Z_hotels/logs/wrk_hotels_20000.log
Running 2m test @ http://c220g1-030826.wisc.cloudlab.us:5000
  4 threads and 128 connections

  Thread calibration: mean lat.: 1935.328ms, rate sampling interval: 7012ms
  Thread calibration: mean lat.: 1932.681ms, rate sampling interval: 7024ms
  Thread calibration: mean lat.: 1941.314ms, rate sampling interval: 7036ms
  Thread calibration: mean lat.: 1918.700ms, rate sampling interval: 7004ms

-----------------------------------------------------------------------
Test Results @ http://c220g1-030826.wisc.cloudlab.us:5000 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    25.32s    12.34s   46.43s    57.87%
    Req/Sec     3.06k    15.46     3.09k    76.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   25.30s 
 75.000%   36.04s 
 90.000%   42.37s 
 99.000%   46.43s 
 99.900%   47.68s 
 99.990%   48.33s 
 99.999%   48.79s 
100.000%   48.82s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3299.327     0.000000            1         1.00
    8232.959     0.100000       134461         1.11
   12558.335     0.200000       268898         1.25
   16809.983     0.300000       403234         1.43
   21069.823     0.400000       538081         1.67
   25296.895     0.500000       671957         2.00
   27426.815     0.550000       739390         2.22
   29556.735     0.600000       806643         2.50
   31735.807     0.650000       873937         2.86
   33947.647     0.700000       941457         3.33
   36044.799     0.750000      1008102         4.00
   37126.143     0.775000      1042299         4.44
   38141.951     0.800000      1075365         5.00
   39190.527     0.825000      1109314         5.71
   40239.103     0.850000      1142589         6.67
   41320.447     0.875000      1176878         8.00
   41844.735     0.887500      1193303         8.89
   42369.023     0.900000      1209673        10.00
   42926.079     0.912500      1226672        11.43
   43483.135     0.925000      1243848        13.33
   44007.423     0.937500      1260286        16.00
   44269.567     0.943750      1268459        17.78
   44531.711     0.950000      1276699        20.00
   44826.623     0.956250      1285768        22.86
   45088.767     0.962500      1293973        26.67
   45350.911     0.968750      1301940        32.00
   45514.751     0.971875      1306974        35.56
   45645.823     0.975000      1310898        40.00
   45776.895     0.978125      1314697        45.71
   45940.735     0.981250      1319222        53.33
   46104.575     0.984375      1323359        64.00
   46202.879     0.985938      1325642        71.11
   46301.183     0.987500      1327754        80.00
   46366.719     0.989062      1329164        91.43
   46497.791     0.990625      1331738       106.67
   46596.095     0.992188      1333509       128.00
   46661.631     0.992969      1334463       142.22
   46727.167     0.993750      1335404       160.00
   46825.471     0.994531      1336522       182.86
   46923.775     0.995313      1337604       213.33
   47054.847     0.996094      1338859       256.00
   47087.615     0.996484      1339187       284.44
   47153.151     0.996875      1339760       320.00
   47218.687     0.997266      1340260       365.71
   47284.223     0.997656      1340697       426.67
   47382.527     0.998047      1341285       512.00
   47415.295     0.998242      1341474       568.89
   47480.831     0.998437      1341793       640.00
   47546.367     0.998633      1342076       731.43
   47611.903     0.998828      1342329       853.33
   47677.439     0.999023      1342568      1024.00
   47710.207     0.999121      1342662      1137.78
   47742.975     0.999219      1342782      1280.00
   47808.511     0.999316      1342962      1462.86
   47841.279     0.999414      1343036      1706.67
   47906.815     0.999512      1343210      2048.00
   47939.583     0.999561      1343288      2275.56
   47939.583     0.999609      1343288      2560.00
   48005.119     0.999658      1343379      2925.71
   48037.887     0.999707      1343423      3413.33
   48103.423     0.999756      1343512      4096.00
   48103.423     0.999780      1343512      4551.11
   48136.191     0.999805      1343555      5120.00
   48168.959     0.999829      1343580      5851.43
   48201.727     0.999854      1343606      6826.67
   48267.263     0.999878      1343645      8192.00
   48300.031     0.999890      1343662      9102.22
   48332.799     0.999902      1343670     10240.00
   48365.567     0.999915      1343689     11702.86
   48398.335     0.999927      1343708     13653.33
   48431.103     0.999939      1343726     16384.00
   48463.871     0.999945      1343733     18204.44
   48496.639     0.999951      1343737     20480.00
   48562.175     0.999957      1343748     23405.71
   48627.711     0.999963      1343756     27306.67
   48660.479     0.999969      1343761     32768.00
   48693.247     0.999973      1343766     36408.89
   48758.783     0.999976      1343781     40960.00
   48758.783     0.999979      1343781     46811.43
   48758.783     0.999982      1343781     54613.33
   48758.783     0.999985      1343781     65536.00
   48791.551     0.999986      1343798     72817.78
   48791.551     0.999988      1343798     81920.00
   48791.551     0.999989      1343798     93622.86
   48791.551     0.999991      1343798    109226.67
   48791.551     0.999992      1343798    131072.00
   48791.551     0.999993      1343798    145635.56
   48791.551     0.999994      1343798    163840.00
   48791.551     0.999995      1343798    187245.71
   48791.551     0.999995      1343798    218453.33
   48791.551     0.999996      1343798    262144.00
   48791.551     0.999997      1343798    291271.11
   48791.551     0.999997      1343798    327680.00
   48791.551     0.999997      1343798    374491.43
   48791.551     0.999998      1343798    436906.67
   48824.319     0.999998      1343801    524288.00
   48824.319     1.000000      1343801          inf
#[Mean    =    25320.985, StdDeviation   =    12339.586]
#[Max     =    48791.552, Total count    =      1343801]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  1466055 requests in 2.00m, 370.10MB read
  Socket errors: connect 0, read 0, write 0, timeout 11
Requests/sec:  12217.14  
Transfer/sec:      3.08MB