hotelReservation/results/client_load_sweeps/20260331T203937Z_hotels/logs/wrk_hotels_6000.log
Running 2m test @ http://c220g1-030826.wisc.cloudlab.us:5000
  4 threads and 128 connections

  Thread calibration: mean lat.: 2.565ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.558ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.558ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.575ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://c220g1-030826.wisc.cloudlab.us:5000 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.56ms    0.91ms   5.78ms   78.76%
    Req/Sec     1.58k   426.70     2.67k    70.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.34ms
 75.000%    2.94ms
 90.000%    3.67ms
 99.000%    5.78ms
 99.900%    7.95ms
 99.990%   11.38ms
 99.999%   16.04ms
100.000%   20.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.113     0.000000            1         1.00
       1.684     0.100000        66283         1.11
       1.856     0.200000       132352         1.25
       2.005     0.300000       198235         1.43
       2.161     0.400000       264679         1.67
       2.339     0.500000       330896         2.00
       2.437     0.550000       363641         2.22
       2.545     0.600000       396752         2.50
       2.661     0.650000       429516         2.86
       2.791     0.700000       462567         3.33
       2.941     0.750000       495913         4.00
       3.023     0.775000       512175         4.44
       3.115     0.800000       528710         5.00
       3.223     0.825000       545359         5.71
       3.343     0.850000       561736         6.67
       3.489     0.875000       578305         8.00
       3.575     0.887500       586411         8.89
       3.675     0.900000       594725        10.00
       3.787     0.912500       602942        11.43
       3.921     0.925000       611249        13.33
       4.081     0.937500       619508        16.00
       4.175     0.943750       623626        17.78
       4.279     0.950000       627757        20.00
       4.399     0.956250       631933        22.86
       4.543     0.962500       636078        26.67
       4.711     0.968750       640093        32.00
       4.815     0.971875       642226        35.56
       4.923     0.975000       644242        40.00
       5.047     0.978125       646338        45.71
       5.187     0.981250       648356        53.33
       5.359     0.984375       650458        64.00
       5.455     0.985938       651482        71.11
       5.567     0.987500       652505        80.00
       5.695     0.989062       653533        91.43
       5.839     0.990625       654545       106.67
       6.015     0.992188       655594       128.00
       6.107     0.992969       656099       142.22
       6.215     0.993750       656620       160.00
       6.335     0.994531       657131       182.86
       6.467     0.995313       657649       213.33
       6.639     0.996094       658157       256.00
       6.743     0.996484       658418       284.44
       6.859     0.996875       658681       320.00
       6.975     0.997266       658938       365.71
       7.135     0.997656       659192       426.67
       7.307     0.998047       659453       512.00
       7.407     0.998242       659583       568.89
       7.507     0.998437       659710       640.00
       7.631     0.998633       659836       731.43
       7.787     0.998828       659967       853.33
       7.975     0.999023       660095      1024.00
       8.091     0.999121       660158      1137.78
       8.239     0.999219       660223      1280.00
       8.375     0.999316       660289      1462.86
       8.519     0.999414       660353      1706.67
       8.735     0.999512       660417      2048.00
       8.855     0.999561       660449      2275.56
       8.991     0.999609       660480      2560.00
       9.159     0.999658       660513      2925.71
       9.407     0.999707       660545      3413.33
       9.655     0.999756       660577      4096.00
       9.839     0.999780       660593      4551.11
      10.087     0.999805       660609      5120.00
      10.335     0.999829       660628      5851.43
      10.551     0.999854       660642      6826.67
      10.983     0.999878       660658      8192.00
      11.215     0.999890       660666      9102.22
      11.439     0.999902       660674     10240.00
      11.559     0.999915       660683     11702.86
      11.743     0.999927       660690     13653.33
      12.031     0.999939       660698     16384.00
      12.303     0.999945       660702     18204.44
      12.439     0.999951       660706     20480.00
      12.591     0.999957       660710     23405.71
      12.887     0.999963       660714     27306.67
      13.631     0.999969       660718     32768.00
      13.671     0.999973       660721     36408.89
      14.103     0.999976       660722     40960.00
      14.215     0.999979       660724     46811.43
      14.247     0.999982       660726     54613.33
      15.391     0.999985       660728     65536.00
      15.695     0.999986       660729     72817.78
      15.791     0.999988       660730     81920.00
      16.039     0.999989       660731     93622.86
      17.007     0.999991       660732    109226.67
      17.103     0.999992       660733    131072.00
      17.439     0.999993       660734    145635.56
      17.439     0.999994       660734    163840.00
      18.319     0.999995       660735    187245.71
      18.319     0.999995       660735    218453.33
      18.959     0.999996       660736    262144.00
      18.959     0.999997       660736    291271.11
      18.959     0.999997       660736    327680.00
      20.095     0.999997       660737    374491.43
      20.095     0.999998       660737    436906.67
      20.095     0.999998       660737    524288.00
      20.095     0.999998       660737    582542.22
      20.095     0.999998       660737    655360.00
      20.223     0.999999       660738    748982.86
      20.223     1.000000       660738          inf
#[Mean    =        2.557, StdDeviation   =        0.906]
#[Max     =       20.208, Total count    =       660738]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  720614 requests in 2.00m, 181.85MB read
Requests/sec:   6005.18  
Transfer/sec:      1.52MB